{"pages":[{"title":"","text":"Hi, 這是微風我是微風。 如你所見，我是一位在師範學校讀電機的剪輯師，簡直是buff上滿平常的樂趣就是剪片，跟看影片–Youtube &amp; Bilibili嚴重中毒如你有什麼問題，歡迎聯繫我的Discord與IG，我將毫不吝嗇的回答你的問題Line只用在工作上，已開啟陌生訊息阻擋，非必要不加好友 「原本要走向PV師,結果變成斜咖meme遊戲影片剪輯師」 聯絡方式 &amp;個人訊息 你所想到的所有聯絡方式都在旁邊了 關於本站：這是一個使用Hexo創建的，託管在GitHub上的個人Blog。在主題Anatole的基礎上做了大量修改和優化，製作成了主題Anatolo。大量模仿锦心大佬的作品，如果大家願意也可以去看看大佬的作品。","link":"/about/index.html"},{"title":"index","text":"","link":"/links/index.html"},{"title":"作品集","text":"Dead by daylight APEX","link":"/Artwork/index.html"},{"title":"Dead by daylight","text":"","link":"/artwork_second_page1/index.html"},{"title":"APEX","text":"","link":"/artwork_second_page2/index.html"}],"posts":[{"title":"實況主們","text":"目前合作中實況主:巨龍阿秉、火爆蟲蟲、紋紋…… 巨龍阿秉YT: https://www.youtube.com/channel/UCVleW5CQMvlZ--jrkHRvqwg巨龍阿秉Twitch:https://www.twitch.tv/blueguy861113 「女裝斜咖」 火爆蟲蟲YT: https://www.youtube.com/channel/UC6t3hvEa2uPI_0-V95jnGEA火爆蟲蟲Twitch:https://www.twitch.tv/152babe 「正妹一個」 紋紋YT: https://www.youtube.com/channel/UCMyxOWKfTBwsXaoav4gEwHA紋紋Twitch:https://www.twitch.tv/wen620 「原本以為是一個正妹實況主，結果還是斜咖一枚，為了滿足自己做了一個大奶的V皮」 已結束合作 阿萬YT:https://www.youtube.com/channel/UCda8AqSoaEG1bSLfnLI6Bqw 「原本以為是正經的實況主，結果還是斜咖一枚」 1234567我們摯愛的阿萬於西元2023年1月9日，悄悄的離開這個實況圈 我們痛徹心扉，就僅僅一眨眼的時間，天人永隔阿萬安祥的走完了一年多的實況人生旅程他彷彿在沉睡中做了一個美夢夢醒了，留下陪伴我們成長過程中的點點滴滴留下我們永恆的追思與感恩 黑皮YT:https://youtube.com/user/specialboil ｢我的第一個剪輯老闆，現在已經不知道跑去哪了｣(開玩笑的，他跑去經營一個 按摩工作室) 安醬YT:https://www.youtube.com/channel/UCIHbuwTjB9ItyR8Bfn5nl-A/videos 「一個玩GTA的女實況主」","link":"/2023/03/19/%E5%AF%A6%E6%B3%81%E4%B8%BB/"},{"title":"Hexo","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2023/03/19/Hexo/"},{"title":"大量的markdown語法","text":"點進來看…… This is intended as a quick reference and showcase. For more complete info, see John Gruber’s original spec and the Github-flavored Markdown info page. This cheatsheet is specifically Markdown Here’s version of Github-flavored Markdown. This differs slightly in styling and syntax from what Github uses, so what you see below might vary a little from what you get in a Markdown Here email, but it should be pretty close. GIF動圖指令表達式1&lt;center&gt;&lt;img src=&quot;/images/image0.gif&quot; width = &quot;&quot; height = &quot;&quot;&gt;&lt;/center&gt; Table of ContentsHeadersEmphasisListsLinksImagesCode and Syntax HighlightingBlockquotesInline HTMLHorizontal RuleLine Breaks ## Headers 1234567891011121314# H1## H2### H3#### H4##### H5###### H6Alternatively, for H1 and H2, an underline-ish style:Alt-H1======Alt-H2------ H1H2H3H4H5H6Alternatively, for H1 and H2, an underline-ish style: Alt-H1Alt-H2 ## Emphasis 12345Emphasis, aka italics, with *asterisks* or _underscores_.Strong emphasis, aka bold, with **asterisks** or __underscores__.Combined emphasis with **asterisks and _underscores_**. Emphasis, aka italics, with asterisks or underscores. Strong emphasis, aka bold, with asterisks or underscores. Combined emphasis with asterisks and underscores. ## Lists 1234567891011121. First ordered list item2. Another item * Unordered sub-list. 1. Actual numbers don't matter, just that it's a number 1. Ordered sub-list4. And another item. Some text that should be aligned with the above item.* Unordered list can use asterisks- Or minuses+ Or pluses First ordered list item Another item Unordered sub-list. Actual numbers don’t matter, just that it’s a number Ordered sub-list And another item. Some text that should be aligned with the above item. Unordered list can use asterisks Or minuses Or pluses ## Links There are two ways to create links. 12345678910111213[I'm an inline-style link](https://www.google.com)[I'm a reference-style link][Arbitrary case-insensitive reference text][You can use numbers for reference-style link definitions][1]Or leave it empty and use the [link text itself][]Some text to show that the reference links can follow later.[arbitrary case-insensitive reference text]: https://www.mozilla.org[1]: http://slashdot.org[link text itself]: http://www.reddit.com I’m an inline-style link I’m a reference-style link You can use numbers for reference-style link definitions Or leave it empty and use the link text itself Some text to show that the reference links can follow later. ## Images 123456789Here's our logo (hover to see the title text):Inline-style: ![alt text](https://github.com/adam-p/markdown-here/raw/master/src/common/images/icon48.png &quot;Logo Title Text 1&quot;)Reference-style: ![alt text][logo][logo]: https://github.com/adam-p/markdown-here/raw/master/src/common/images/icon48.png &quot;Logo Title Text 2&quot; Here’s our logo (hover to see the title text): Inline-style: Reference-style: ## Code and Syntax Highlighting Code blocks are part of the Markdown spec, but syntax highlighting isn’t. However, many renderers – like Github’s and Markdown Here – support syntax highlighting. Markdown Here supports highlighting for dozens of languages (and not-really-languages, like diffs and HTTP headers); to see the complete list, and how to write the language names, see the highlight.js demo page. 1Inline `code` has `back-ticks around` it. Inline code has back-ticks around it. Blocks of code are either fenced by lines with three back-ticks ```, or are indented with four spaces. I recommend only using the fenced code blocks – they’re easier and only they support syntax highlighting. 123```javascriptvar s = &quot;JavaScript syntax highlighting&quot;;alert(s); 12s = &quot;Python syntax highlighting&quot;print s 12No language indicated, so no syntax highlighting. But let's throw in a &lt;b&gt;tag&lt;/b&gt;. 1234```javascriptvar s = &quot;JavaScript syntax highlighting&quot;;alert(s); 12s = &quot;Python syntax highlighting&quot;print s 12No language indicated, so no syntax highlighting in Markdown Here (varies on Github). But let's throw in a &lt;b&gt;tag&lt;/b&gt;. (Github Wiki pages don’t seem to support syntax highlighting, so the above won’t be colourful (the strings are not red, for example). Try it out in a Markdown Here email or a Github Markdown README or Github Issue – you can preview a new Issue without submitting it.) Again, to see what languages are available for highlighting, and how to write those language names, see the highlight.js demo page. ## Blockquotes 123456&gt; Blockquotes are very handy in email to emulate reply text.&gt; This line is part of the same quote.Quote break.&gt; This is a very long line that will still be quoted properly when it wraps. Oh boy let's keep writing to make sure this is long enough to actually wrap for everyone. Oh, you can *put* **Markdown** into a blockquote. Blockquotes are very handy in email to emulate reply text.This line is part of the same quote. Quote break. This is a very long line that will still be quoted properly when it wraps. Oh boy let’s keep writing to make sure this is long enough to actually wrap for everyone. Oh, you can put Markdown into a blockquote. ## Inline HTML You can also use raw HTML in your Markdown, and it’ll mostly work pretty well. Here are a couple of common examples: 12345678910111213141516171819202122232425262728&lt;dl&gt; &lt;dt&gt;Definition list&lt;/dt&gt; &lt;dd&gt;Is something people use sometimes.&lt;/dd&gt; &lt;dt&gt;Markdown in HTML&lt;/dt&gt; &lt;dd&gt;Does *not* work **very** well. Use HTML &lt;em&gt;tags&lt;/em&gt;.&lt;/dd&gt;&lt;/dl&gt;&lt;table&gt; &lt;tr&gt; &lt;th&gt;&lt;/th&gt; &lt;th&gt;Tables&lt;/th&gt; &lt;th&gt;Are&lt;/th&gt; &lt;th&gt;Cool&lt;/th&gt; &lt;/tr&gt; &lt;tr&gt; &lt;th&gt;Zebra&lt;/th&gt; &lt;td&gt;Stripes&lt;/td&gt; &lt;td&gt;Are&lt;/td&gt; &lt;td&gt;Pretty&lt;/td&gt; &lt;/tr&gt; &lt;tr&gt; &lt;th&gt;Here&lt;/th&gt; &lt;td&gt;Is&lt;/td&gt; &lt;td&gt;Another&lt;/td&gt; &lt;td&gt;Row&lt;/td&gt; &lt;/tr&gt;&lt;/table&gt; Definition list Is something people use sometimes. Markdown in HTML Does *not* work **very** well. Use HTML tags. Tables Are Cool Zebra Stripes Are Pretty Here Is Another Row Github-flavored Markdown supports a special table syntax, but Markdown Here does not support it yet. There’s an issue for it. ## Horizontal Rule 12345678910111213Three or more...---Hyphens***Asterisks___Underscores Three or more… Hyphens Asterisks Underscores ## Line Breaks My basic recommendation for learning how line breaks work is to experiment and discover – hit &lt;Enter&gt; once, then hit it twice, see what happens. You’ll soon learn to get what you want. “Markdown Toggle” is your friend. Here are some things to try out: 1234567With only a single newline, this line andthis line will be a *single line*.But this one is separated by two newlines and so will be a *separate paragraph*.This line has two spaces at the end (hard for you to see, but trust me!). So this is a separate line in the *same paragraph*. With only a single newline, this line andthis line will be a single line. But this one is separated by two newlines and so will be a separate paragraph. This line has two spaces at the end (hard for you to see, but trust me!).So this is a separate line in the same paragraph.","link":"/2023/03/19/markdown/"},{"title":"Hello World","text":"你好，世界 這是一個由開源Hexo所架設的網站，謝謝各方開源人士的幫忙 Anatolo简介Anatolo是一個基於Hexo blog框架的主題，旨在為用戶提供簡潔、優美、易於定制的blog主題。 特性 簡潔美觀：清新簡潔的設計，專注於內容展示。 響應式設計：針對不同設備自動調整佈局，提供更好的閱讀體驗。 高度定制化：提供大量可配置的選項，可定制博客主題的各個方面。 支持多種代碼高亮風格：提供多種代碼高亮風格，讓代碼展示更美觀。 響應式音樂播放器：集成了響應式音樂播放器，支持多種音頻格式，讓你的博客更有趣。 使用安裝Clone: 1234git clone https://gitee.com/Lhcfl/hexo-theme-anatolo.git themes/Anatolo或者直接下載主題zip包解壓至主題目錄下，重命名為Anatolo 安裝依賴 123npm install hexo-renderer-pug --savenpm install hexo-renderer-stylus --save 配置複製_config.example.yml為_config.yml修改hexo根目錄下的 _config.yml ： theme: Anatolo","link":"/2023/03/19/Hello%20World/"},{"title":"Computer","text":"body { font-family: Arial, sans-serif; color: #333; background-color: #eee; margin: 0; padding: 0; } h1 { text-align: center; font-size: 36px; margin-top: 50px; } .container { margin: 0 auto; max-width: 800px; padding: 20px; background-color: #fff; box-shadow: 0px 0px 10px rgba(0, 0, 0, 0.5); /* 加上陰影效果 */ } h2 { font-size: 24px; margin-top: 40px; } th { background-color: #f2f2f2; } table { table-layout: fixed; width: 100%; border-collapse: collapse; } th, td { padding: 10px; border: 1px solid black; text-align: center; } th:first-child { width: 30%; } td:nth-child(2) { width: 70%; } 我的桌機 CPU 品牌 Intel 型號 i7-11700F 記憶體 品牌 美光普條 容量 32GB (8GBx4) 顯卡 品牌 EVGA 型號 3060 主機板 品牌 AORUS 型號 B560M PRO AX 電源 品牌 EVGA 型號 650w 儲存裝置 固態硬碟 PNY CS3140 1TB 固態硬碟 美光P2 512GB 我的筆電 筆電型號 Lenovo Thinkbook 14+ 2023 CPU i5-13500H 記憶體 32GB 固態硬碟 512GB","link":"/2023/03/24/%E9%9B%BB%E8%85%A6%E9%85%8D%E7%BD%AE/"}],"tags":[{"name":"實況主","slug":"實況主","link":"/tags/%E5%AF%A6%E6%B3%81%E4%B8%BB/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"}],"categories":[{"name":"遊戲","slug":"遊戲","link":"/categories/%E9%81%8A%E6%88%B2/"},{"name":"網頁","slug":"網頁","link":"/categories/%E7%B6%B2%E9%A0%81/"}]}